2018/python-generator.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 生成器</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 生成器</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc9c8fcb">1. 简介</a></li>
<li><a href="#org59c84c7">2. 创建生成器</a></li>
<li><a href="#orgfa46983">3. 简单的使用</a></li>
<li><a href="#org3edbdcf">4. 生成器对象</a></li>
<li><a href="#org51f707b">5. 新的特性</a></li>
<li><a href="#org5275bc5">6. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc9c8fcb" class="outline-2">
<h2 id="orgc9c8fcb"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>生成器</b> 这个对于 <code>Python</code> 使用者来说应该并不陌生， <del>毕竟现在的 <code>Python3</code> 中部分内置函数的返回值就是一个 <b>生成器</b>.</del>
</p>

<p>
然而前段时间学习 <b>协程</b> 的过程中才发现，虽然 <b>生成器</b> 对于我来说并不陌生，但也算不上熟悉。
</p>
</div>
</div>

<div id="outline-container-org59c84c7" class="outline-2">
<h2 id="org59c84c7"><span class="section-number-2">2</span> 创建生成器</h2>
<div class="outline-text-2" id="text-2">
<p>
创建生成器的方式有两种：
</p>
<ol class="org-ol">
<li>通过 <b>生成器表达式</b></li>
<li>通过 <b>生成器函数</b></li>
</ol>

<p>
<b>生成器表达式</b> 简单快捷，足以胜任简单的生成器创建工作，其形式和 <b>列表推导式</b> 类似，只不过将中括号 <code>[]</code> 替换成了小括号 <code>()</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">In [1]: <span class="org-variable-name">generator</span> = (x * x <span class="org-keyword">for</span> x <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10))

In [2]: <span class="org-builtin">type</span>(generator)
Out[2]: generator

In [3]: <span class="org-variable-name">lst</span> = [x * x <span class="org-keyword">for</span> x <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10)]

In [4]: <span class="org-builtin">type</span>(lst)
Out[4]: <span class="org-builtin">list</span>
</pre>
</div>

<p>
<b>生成器表达式</b> 虽然简单，但是难以胜任复杂的工作，这时就需要通过 <b>生成器函数</b> 来创建生成器。
</p>

<p>
<del>内置函数中类似 <code>range()</code> 的函数都是一个生成器函数</del>, 调用这些 <b>生成器函数</b> 是返回的是一个 <b>生成器对象</b>.
</p>

<p>
要让一个 <b>函数</b> 成为 <b>生成器函数</b> 很简单，只需要将函数中的 <code>return</code> 替换为 <code>yield</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">In [1]: <span class="org-keyword">def</span> <span class="org-function-name">fib</span>(<span class="org-builtin">max</span>):
   ...:     <span class="org-variable-name">n</span>, <span class="org-variable-name">a</span>, <span class="org-variable-name">b</span> = 0, 0, 1
   ...:     <span class="org-keyword">while</span> n &lt; <span class="org-builtin">max</span>:
   ...:         <span class="org-keyword">yield</span> b
   ...:         <span class="org-variable-name">a</span>, <span class="org-variable-name">b</span> = b, a + 1
   ...:         <span class="org-variable-name">n</span> = n + 1
   ...:     <span class="org-keyword">return</span> <span class="org-string">'done'</span>
   ...:

In [2]: <span class="org-variable-name">f</span> = fib(6)

In [3]: <span class="org-builtin">type</span>(f)
Out[3]: generator
</pre>
</div>

<p>
<b>NOTE:</b> <code>Python2</code> 中生成器函数不允许存在 <code>return</code> 语句
</p>

<p>
生成器函数中，每次执行到 <code>yield</code> 语句就会返回，再次执行时从上次返回的 <code>yield</code> 语句处继续执行。
</p>
</div>
</div>

<div id="outline-container-orgfa46983" class="outline-2">
<h2 id="orgfa46983"><span class="section-number-2">3</span> 简单的使用</h2>
<div class="outline-text-2" id="text-3">
<p>
我们可以通过内置函数 <code>next()</code> 获取 <b>生成器</b> 的下一个返回值，如果没有更多的返回值时，调用 <code>next()</code> 就会抛出 <code>StopIteration</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">In [4]: <span class="org-variable-name">generator</span> = (x * x <span class="org-keyword">for</span> x <span class="org-keyword">in</span> <span class="org-builtin">range</span>(3))

In [5]: <span class="org-builtin">next</span>(generator)
Out[5]: 0

In [6]: <span class="org-builtin">next</span>(generator)
Out[6]: 1

In [7]: <span class="org-builtin">next</span>(generator)
Out[7]: 4

In [8]: <span class="org-builtin">next</span>(generator)
---------------------------------------------------------------------------
<span class="org-type">StopIteration</span>                             Traceback (most recent call last)
&lt;ipython-<span class="org-builtin">input</span>-8-1d0a8ea12077&gt; <span class="org-keyword">in</span> &lt;module&gt;()
----&gt; 1 <span class="org-builtin">next</span>(generator)

<span class="org-type">StopIteration</span>:
</pre>
</div>

<p>
但更一般的使用方法是将 <b>生成器</b> 当做一个 <b>可迭代</b> 对象使用，将之放入 <code>for</code> 循环或者用做 <b>函数参数</b>.
</p>

<div class="org-src-container">
<pre class="src src-python">In [19]: <span class="org-keyword">def</span> <span class="org-function-name">fib</span>(<span class="org-builtin">max</span>):
    ...:     <span class="org-variable-name">n</span>, <span class="org-variable-name">a</span>, <span class="org-variable-name">b</span> = 0, 0, 1
    ...:     <span class="org-keyword">while</span> n &lt; <span class="org-builtin">max</span>:
    ...:         <span class="org-keyword">yield</span> b
    ...:         <span class="org-variable-name">a</span>, <span class="org-variable-name">b</span> = b, a + 1
    ...:         <span class="org-variable-name">n</span> = n + 1
    ...:     <span class="org-keyword">return</span> <span class="org-string">'done'</span>
    ...:

In [20]: <span class="org-variable-name">f</span> = fib(10)

In [21]: <span class="org-variable-name">lst</span> = []

In [22]: <span class="org-keyword">for</span> val <span class="org-keyword">in</span> f:
    ...:     lst.append(val)
    ...:

In [23]: lst
Out[23]: [1, 1, 2, 2, 3, 3, 4, 4, 5, 5]

In [24]: <span class="org-builtin">list</span>(fib(10))
Out[24]: [1, 1, 2, 2, 3, 3, 4, 4, 5, 5]
</pre>
</div>

<p>
这样一来就不需要担心会遇到 <code>StopIteration</code> 了。
</p>
</div>
</div>

<div id="outline-container-org3edbdcf" class="outline-2">
<h2 id="org3edbdcf"><span class="section-number-2">4</span> 生成器对象</h2>
<div class="outline-text-2" id="text-4">
<p>
生成器的完整名称应该是生成器 <b>对象</b>, 既然是一个对象，那么自然有 <b>方法</b> 和 <b>属性</b>.
</p>

<div class="org-src-container">
<pre class="src src-python">In [45]: <span class="org-variable-name">g</span> = (x <span class="org-keyword">for</span> x <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10))

In [46]: <span class="org-builtin">help</span>(g)
Help on generator <span class="org-builtin">object</span>:

&lt;genexpr&gt; = <span class="org-keyword">class</span> <span class="org-type">generator</span>(<span class="org-builtin">object</span>)
 |  Methods defined here:
 |
 |  close(...)
 |      close() -&gt; <span class="org-keyword">raise</span> <span class="org-type">GeneratorExit</span> inside generator.
 |
 |  send(...)
 |      send(arg) -&gt; send <span class="org-string">'arg'</span> into generator,
 |      <span class="org-keyword">return</span> <span class="org-builtin">next</span> yielded value <span class="org-keyword">or</span> <span class="org-keyword">raise</span> <span class="org-type">StopIteration</span>.
 |
 |  throw(...)
 |      throw(typ[,val[,tb]]) -&gt; <span class="org-keyword">raise</span> exception <span class="org-keyword">in</span> generator,
 |      <span class="org-keyword">return</span> <span class="org-builtin">next</span> yielded value <span class="org-keyword">or</span> <span class="org-keyword">raise</span> <span class="org-type">StopIteration</span>.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  gi_code
 |
 |  gi_frame
 |
 |  gi_running
 |
 |  gi_yieldfrom
 |      <span class="org-builtin">object</span> being iterated by <span class="org-keyword">yield</span> <span class="org-keyword">from</span>, <span class="org-keyword">or</span> <span class="org-constant">None</span>
</pre>
</div>

<p>
通过万能的 <code>help</code> 我们获得了 <b>生成器对象</b> 的 <b>方法</b> 和 <b>属性</b>. 现在的主要问题就是它们的 <b>作用</b>.
</p>

<p>
方法 <code>close</code> 会在生成器内部抛出一个 <code>GeneratorExit</code> 异常：
</p>
<div class="org-src-container">
<pre class="src src-python">In [54]: <span class="org-keyword">def</span> <span class="org-function-name">gen</span>():
    ...:     <span class="org-keyword">try</span>:
    ...:         <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10):
    ...:             <span class="org-keyword">yield</span> i
    ...:     <span class="org-keyword">except</span> <span class="org-type">GeneratorExit</span>:
    ...:         <span class="org-keyword">print</span>(<span class="org-string">'close generator'</span>)
    ...:

In [55]: <span class="org-variable-name">g</span> = gen()

In [56]: <span class="org-builtin">next</span>(g)
Out[56]: 0

In [57]: g.close()
close generator

In [58]: <span class="org-builtin">next</span>(g)
---------------------------------------------------------------------------
<span class="org-type">StopIteration</span>                             Traceback (most recent call last)
&lt;ipython-<span class="org-builtin">input</span>-58-5f315c5de15b&gt; <span class="org-keyword">in</span> &lt;module&gt;()
----&gt; 1 <span class="org-builtin">next</span>(g)

<span class="org-type">StopIteration</span>:
</pre>
</div>

<p>
特别的，可以不用 <code>catch</code> 抛出的 <code>GeneratorExit</code> 异常：
</p>
<div class="org-src-container">
<pre class="src src-python">In [1]: <span class="org-keyword">def</span> <span class="org-function-name">gen</span>():
   ...:     <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10):
   ...:         <span class="org-keyword">yield</span> i
   ...:

In [2]: <span class="org-variable-name">g</span> = gen()

In [3]: <span class="org-builtin">next</span>(g)
Out[3]: 0

In [4]: g.close()

In [5]: <span class="org-builtin">next</span>(g)
---------------------------------------------------------------------------
<span class="org-type">StopIteration</span>                             Traceback (most recent call last)
&lt;ipython-<span class="org-builtin">input</span>-6-5f315c5de15b&gt; <span class="org-keyword">in</span> &lt;module&gt;()
----&gt; 1 <span class="org-builtin">next</span>(g)

<span class="org-type">StopIteration</span>:
</pre>
</div>

<p>
方法 <code>send</code> 传递一个参数到 <b>生成器内部</b>, 那么问题来了，这个参数是怎样传递的呢？
</p>
<div class="org-src-container">
<pre class="src src-python">In [65]: <span class="org-keyword">def</span> <span class="org-function-name">gen</span>():
    ...:     <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10):
    ...:         <span class="org-variable-name">arg</span> = <span class="org-keyword">yield</span> i
    ...:         <span class="org-keyword">print</span>(arg)
    ...:

In [66]: <span class="org-variable-name">g</span> = gen()

In [67]: g.send(<span class="org-constant">None</span>)
Out[67]: 0

In [69]: g.send(10)
10
Out[69]: 1

In [70]: <span class="org-builtin">next</span>(g)
<span class="org-constant">None</span>
Out[70]: 2
</pre>
</div>

<p>
生成器通过 <code>yield</code> 语句返回值，同时也通过 <code>yield</code> 语句传递 <code>send()</code> 的参数。
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">arg</span> = <span class="org-keyword">yield</span> i
</pre>
</div>

<p>
需要注意的是： 生成器启动的时候传递的参数必须是 <code>None</code>, 否则会出错。
</p>
<div class="org-src-container">
<pre class="src src-python">g.send(<span class="org-constant">None</span>)
</pre>
</div>

<p>
因为在生成器启动的时候，函数内部还没有执行到 <code>yield</code> 语句，自然也就无法传递参数。
</p>

<p>
同时， <code>yield</code> 的返回值默认为 <code>None</code>.
</p>
<div class="org-src-container">
<pre class="src src-python">In [70]: <span class="org-builtin">next</span>(g)
<span class="org-constant">None</span>
Out[70]: 2
</pre>
</div>

<p>
然后是方法 <code>throw</code>, 在 <b>生成器</b> 内部抛出一个异常，然后返回下一个值或抛出 <code>StopIteration</code>.
</p>
<div class="org-src-container">
<pre class="src src-python">In [1]: <span class="org-keyword">def</span> <span class="org-function-name">gen</span>():
   ...:     <span class="org-keyword">try</span>:
   ...:         <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10):
   ...:             <span class="org-keyword">yield</span> i * i
   ...:     <span class="org-keyword">except</span> <span class="org-type">Exception</span> <span class="org-keyword">as</span> ex:
   ...:         <span class="org-keyword">print</span>(ex)
   ...:     <span class="org-keyword">yield</span> -1
   ...:

In [2]: <span class="org-variable-name">g</span> = gen()

In [3]: <span class="org-builtin">next</span>(g)
Out[3]: 0

In [4]: <span class="org-builtin">next</span>(g)
Out[4]: 1

In [5]: g.throw(<span class="org-type">Exception</span>, <span class="org-string">'throw'</span>)
throw
Out[5]: -1
</pre>
</div>

<p>
虽然知道了这些方法的作用，但一般的使用估计都用不上这些方法 QAQ
</p>

<p>
对于剩下的几个属性，说实话，暂时还不知道这几个属性是干啥的， <code>gi_yieldfrom</code> 和 <code>gi_running</code> 还有所猜测但是其他几个就完成不清楚了。
</p>

<p>
谷歌也没有找到答案，也许是方式不对，等知道了在补上。
</p>
</div>
</div>

<div id="outline-container-org51f707b" class="outline-2">
<h2 id="org51f707b"><span class="section-number-2">5</span> 新的特性</h2>
<div class="outline-text-2" id="text-5">
<p>
从 <code>3.3</code> 开始， <code>yield</code> 语句可以这样：
</p>
<div class="org-src-container">
<pre class="src src-python">In [8]: <span class="org-keyword">def</span> <span class="org-function-name">gen</span>():
   ...:     <span class="org-keyword">yield</span> <span class="org-keyword">from</span> <span class="org-builtin">range</span>(10)
   ...:

In [9]: <span class="org-variable-name">g</span> = gen()

In [10]: <span class="org-builtin">next</span>(g)
Out[10]: 0
</pre>
</div>

<p>
这个需要 <code>yield from</code> 后面跟的对象是一个 <b>可迭代</b> 对象。
</p>

<p>
相关的文档： <a href="https://www.python.org/dev/peps/pep-0380/">PEP 380 &#x2013; Syntax for Delegating to a Subgenerator</a>
</p>
</div>
</div>

<div id="outline-container-org5275bc5" class="outline-2">
<h2 id="org5275bc5"><span class="section-number-2">6</span> 结语</h2>
<div class="outline-text-2" id="text-6">
<p>
在学习 <b>协程</b> 之前我是万万没想到生成器对象居然存在方法和属性，毕竟平时还是简单的使用为主。
</p>

<p>
然而事实证明， <code>Python</code> 果然是一个神奇的语言，鬼知道在什么地方藏了什么奇葩的特性。
</p>

<p>
坑！！！
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
